## Staging: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 3 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                      NAME                      |
|----------|------------------------------------------------|
| update   | `aws_eks_addon.coredns`                        |
|          | `aws_eks_addon.ebs_driver`                     |
|          | `aws_eks_addon.kube_proxy`                     |
| recreate | `aws_route53_record.notification_internal_dns` |
|          | `aws_route53_record.wildcard_CNAME`            |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eks_addon.coredns will be updated in-place
  ~ resource "aws_eks_addon" "coredns" {
      + configuration_values        = jsonencode(
            {
              + corefile = <<-EOT
                    .:53 {
                        log
                        errors
                        health {
                            lameduck 5s
                          }
                        ready
                        kubernetes cluster.local in-addr.arpa ip6.arpa {
                          pods insecure
                          fallthrough in-addr.arpa ip6.arpa
                        }
                        prometheus :9153
                        forward . /etc/resolv.conf
                        cache 60
                        loop
                        reload
                        loadbalance
                    }
                EOT
            }
        )
        id                          = "notification-canada-ca-staging-eks-cluster:coredns"
        tags                        = {}
        # (9 unchanged attributes hidden)
    }

  # aws_eks_addon.ebs_driver will be updated in-place
  ~ resource "aws_eks_addon" "ebs_driver" {
      ~ addon_version               = "v1.26.1-eksbuild.1" -> "v1.27.0-eksbuild.1"
        id                          = "notification-canada-ca-staging-eks-cluster:aws-ebs-csi-driver"
        tags                        = {}
        # (8 unchanged attributes hidden)
    }

  # aws_eks_addon.kube_proxy will be updated in-place
  ~ resource "aws_eks_addon" "kube_proxy" {
      ~ addon_version               = "v1.29.0-eksbuild.1" -> "v1.29.0-eksbuild.3"
        id                          = "notification-canada-ca-staging-eks-cluster:kube-proxy"
        tags                        = {}
        # (8 unchanged attributes hidden)
    }

  # aws_route53_record.notification_internal_dns must be replaced
-/+ resource "aws_route53_record" "notification_internal_dns" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "staging.notification.internal" -> (known after apply)
      ~ id                               = "Z02876331ZPQRHQIX5GMX_staging.notification.internal_A" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
      ~ name                             = "staging.notification.internal" -> "staging.notification.internal.com" # forces replacement
      - records                          = [] -> null
      - ttl                              = 0 -> null
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_route53_record.wildcard_CNAME must be replaced
-/+ resource "aws_route53_record" "wildcard_CNAME" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "*.staging.notification.internal" -> (known after apply)
      ~ id                               = "Z02876331ZPQRHQIX5GMX_*.staging.notification.internal_CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
      ~ name                             = "*.staging.notification.internal" -> "*.staging.notification.internal.com" # forces replacement
      ~ records                          = [
          - "staging.notification.internal",
          + "staging.notification.internal.com",
        ]
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 3 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-memory-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-replicas-unavailable[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.aggregating-queues-not-active-1-minute-warning[0]"]
WARN -...
```

</details>
